"""
קלוט מספרים מהמשתמש עד שמתקבל רצף של 3 מספרים עוקבים שעולים (כל אחד גדול מהקודם)

דוגמה לרצף קלט אפשרי: 1 0 1 1 2 2 3- 8 7 9 11

במקרה הזה התוכנית תסתיים כי התקבל הרצף 7 9 11

רמז:

שמור את המספר הקודם במשתנה
בכל פעם שהמספר החדש גדול מהקודם – הגדל מונה ב־1
אחרת – אפס את המונה חזרה ל־1
עצור את הלולאה כאשר המונה מגיע ל־3
"""

count = 1
previous = int(input("please enter a number: "))
while True:
    number = int(input("please enter a number: "))
    if number > previous:
        count += 1
    else:
        count = 1
    if count == 3:
        break