"""
המטרה: לקלוט גילאים של 10 שחקני חטיבת ביניים לקבוצת כדורסל

כללים:

בצע לולאה כדי לנסות לקלוט 10 גילאים
אם הגיל קטן מ־12 – התעלם ממנו (לא סופר כשחקן תקין) והמשך ללולאה
אם הגיל גדול מ־18 – צא מהלולאה עם break (זה "מבוגר מדי" לקבוצת נוער) מכיוון שעלולים לפסול את הקבוצה
אחרת – הגיל תקין וספור אותו כשחקן תקין
אחרי הלולאה, הדפס כמה שחקנים תקינים הצלחת לאסוף. וכמה שחקנים מעל גיל 16 ספרת
"""

for count in range(1, 11):
    player_age = input("Player Age: ")
    if player_age < 12:
        continue
    if player_age >= 18:
        break
    count += 1
    if count == 10:
        break
print(count)