"""
שאלה 3 – אתגר מספר ראשוני
כתוב תוכנית שקולטת מספר שלם ומדפיסה אם הוא ראשוני או לא

תזכורת: מספר ראשוני מתחלק רק ב־1 ובעצמו דוגמאות למספרים ראשוניים: 2, 3, 5, 7, 11, 13, 17, 19, 23

אלגוריתם מומלץ:

אם המספר קטן או שווה ל־1 – הוא לא ראשוני
אחרת, בדוק בלולאה מחלקים מ־2 ועד המספר (לא כולל המספר)
אם מצאת מחלק בלי שארית – הוא לא ראשוני
אם לא מצאת אף מחלק – הוא ראשוני
"""

prime = True
num_check = int(input("please input a number: "))
if num_check <= 1:
    prime = False

for _ in range(2, (num_check // 2) + 1):
    if num_check % _ == 0:
        prime = False
        break

print(f"The number is prime: {prime}")